Revit 2027 API
ClassificationEntry Properties
The ClassificationEntry type exposes the following members.
Properties
Name | Description
CategoryId |  The id of the category associated with this entry.
Description |  The description associated with this entry.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from KeyBasedTreeEntry)
Key |  The key of this entry.
(Inherited from KeyBasedTreeEntry)
Level |  The entry level in the classification table. The expected range is between 1 and 5 inclusive.
ParentKey |  The parent key of this entry.
(Inherited from KeyBasedTreeEntry)
Top
See Also
Reference
ClassificationEntry Class
Autodesk.Revit.DB Namespace